cask_args appdir: '/Applications'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'puma/puma'
tap 'homebrew/completions'
tap 'homebrew/dupes'

brew 'bash'
brew 'ack'
brew 'git'
brew 'hub'
brew 'imagemagick'
brew 'qt'
brew 'libyaml'
brew 'gnutls'
brew 'tree'
brew 'gmp'
brew 'blueutil'
brew 'curl'
brew 'coreutils'
brew 'findutils'
brew 'z'
brew 'grc'
brew 'fdupes'
brew 'freetype'
brew 'libpng'
brew 'libtiff'
brew 'redis'
brew 'rbenv'
brew 'ruby-build'
brew 'go'
brew 'grc'
brew 'spark'
brew 'switchaudio-osx'

brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'unrar'
brew 'wget'
brew 'yarn'


cask '1password'
cask 'air-video-server-hd'
cask 'alfred'
cask 'atom'
cask 'avidemux'
cask 'betterzipql'
cask 'bitlord'
cask 'boot2docker'
cask 'caffeine'
cask 'clamxav'
cask 'codekit'
cask 'diffmerge'
cask 'discord-ptb'
cask 'diskmaker-x'
cask 'dockertoolbox'
cask 'downie'
cask 'dropbox'
cask 'epubquicklook'
cask 'evernote'
cask 'firefox'
cask 'flip4mac'
cask 'flux'
cask 'font-anonymous-pro'
cask 'font-inconsolata'
cask 'font-istok-web'
cask 'font-lato'
cask 'font-merriweather'
cask 'font-muli'
cask 'font-nunito'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'github-desktop'
cask 'gitkraken'
cask 'gitup'
cask 'google-chrome'
cask 'google-earth'
cask 'handbrake'
cask 'imagealpha'
cask 'imageoptim'
cask 'install-disk-creator'
cask 'istat-menus'
cask 'keyboard-maestro'
cask 'lepton'
cask 'little-snitch'
cask 'macx-video-converter-pro'
cask 'media-converter'
cask 'minecraft'
cask 'mplayerx'
cask 'ngrok'
cask 'omnigraffle'
cask 'p4merge'
cask 'pgadmin4'
cask 'plex-media-player'
cask 'plex-media-server'
cask 'postgres'
cask 'postico'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'razorsql'
cask 'rubymine'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'sublime-text'
cask 'superduper'
cask 'teleport'
cask 'textexpander'
cask 'textmate'
cask 'the-unarchiver'
cask 'transmission'
cask 'tubbler'
cask 'usb-overdrive'
cask 'virtualbox'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vlc'

cask 'font-inconsolata'
cask 'font-source-code-pro'
